OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1778.h
#define _DAC7CON1_DACR0         0x01
#define _DAC7CON1_R0            0x01
#define _DAC7CON1_DAC7R0        0x01
#define _DAC7CON1_REF0          0x01
#define _DAC7CON1_DAC7REF0      0x01
#define _DAC7CON1_DACR1         0x02
#define _DAC7CON1_R1            0x02
#define _DAC7CON1_DAC7R1        0x02
#define _DAC7CON1_REF1          0x02
#define _DAC7CON1_DAC7REF1      0x02
#define _DAC7CON1_DACR2         0x04
#define _DAC7CON1_R2            0x04
#define _DAC7CON1_DAC7R2        0x04
#define _DAC7CON1_REF2          0x04
#define _DAC7CON1_DAC7REF2      0x04
#define _DAC7CON1_DACR3         0x08
#define _DAC7CON1_R3            0x08
#define _DAC7CON1_DAC7R3        0x08
#define _DAC7CON1_REF3          0x08
#define _DAC7CON1_DAC7REF3      0x08
#define _DAC7CON1_DACR4         0x10
#define _DAC7CON1_R4            0x10
#define _DAC7CON1_DAC7R4        0x10
#define _DAC7CON1_REF4          0x10
#define _DAC7CON1_DAC7REF4      0x10

//==============================================================================


//==============================================================================
//        DAC7REF Bits

extern __at(0x059F) __sfr DAC7REF;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7R0             : 1;
    unsigned DAC7R1             : 1;
    unsigned DAC7R2             : 1;
    unsigned DAC7R3             : 1;
    unsigned DAC7R4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7REF0           : 1;
    unsigned DAC7REF1           : 1;
    unsigned DAC7REF2           : 1;
    unsigned DAC7REF3           : 1;
    unsigned DAC7REF4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DAC7REF            : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned DAC7R              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned REF                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned R                  : 5;
    unsigned                    : 3;
    };
  } __DAC7REFbits_t;

extern __at(0x059F) volatile __DAC7REFbits_t DAC7REFbits;

#define _DAC7REF_DACR0          0x01
#define _DAC7REF_R0             0x01
#define _DAC7REF_DAC7R0         0x01
#define _DAC7REF_REF0           0x01
#define _DAC7REF_DAC7REF0       0x01
#define _DAC7REF_DACR1          0x02
#define _DAC7REF_R1             0x02
#define _DAC7REF_DAC7R1         0x02
#define _DAC7REF_REF1           0x02
#define _DAC7REF_DAC7REF1       0x02
#define _DAC7REF_DACR2          0x04
#define _DAC7REF_R2             0x04
#define _DAC7REF_DAC7R2         0x04
#define _DAC7REF_REF2           0x04
#define _DAC7REF_DAC7REF2       0x04
#define _DAC7REF_DACR3          0x08
#define _DAC7REF_R3             0x08
#define _DAC7REF_DAC7R3         0x08
#define _DAC7REF_REF3           0x08
#define _DAC7REF_DAC7REF3       0x08
#define _DAC7REF_DACR4          0x10
#define _DAC7REF_R4             0x10
#define _DAC7REF_DAC7R4         0x10
#define _DAC7REF_REF4           0x10
#define _DAC7REF_DAC7REF4       0x10

//==============================================================================


//==============================================================================
//        PWM3DCL Bits

extern __at(0x0614) __sfr PWM3DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM3DC0            : 1;
    unsigned PWM3DC1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWMPW0             : 1;
    unsigned PWMPW1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWMPW              : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM3DC             : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned DC                 : 2;
    };
  } __PWM3DCLbits_t;

extern __at(0x0614) volatile __PWM3DCLbits_t PWM3DCLbits;

#define _DC0                    0x40
#define _PWM3DC0                0x40
#define _PWMPW0                 0x40
#define _DC1                    0x80
#define _PWM3DC1                0x80
#define _PWMPW1                 0x80

//==============================================================================


//==============================================================================
//        PWM3DCH Bits

extern __at(0x0615) __sfr PWM3DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM3DC2            : 1;
    unsigned PWM3DC3            : 1;
    unsigned PWM3DC4            : 1;
    unsigned PWM3DC5            : 1;
    unsigned PWM3DC6            : 1;
    unsigned PWM3DC7            : 1;
    unsigned PWM3DC8            : 1;
    unsigned PWM3DC9            : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM3DCHbits_t;

extern __at(0x0615) volatile __PWM3DCHbits_t PWM3DCHbits;

