OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1778.h
extern __at(0x0619) __sfr PWM4CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM4POL            : 1;
    unsigned PWM4OUT            : 1;
    unsigned                    : 1;
    unsigned PWM4EN             : 1;
    };
  } __PWM4CONbits_t;

extern __at(0x0619) volatile __PWM4CONbits_t PWM4CONbits;

#define _PWM4CON_POL            0x10
#define _PWM4CON_PWM4POL        0x10
#define _PWM4CON_OUT            0x20
#define _PWM4CON_PWM4OUT        0x20
#define _PWM4CON_EN             0x80
#define _PWM4CON_PWM4EN         0x80

//==============================================================================


//==============================================================================
//        PWM9DCL Bits

extern __at(0x061A) __sfr PWM9DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM9DC0            : 1;
    unsigned PWM9DC1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWMPW0             : 1;
    unsigned PWMPW1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWMPW              : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned DC                 : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM9DC             : 2;
    };
  } __PWM9DCLbits_t;

extern __at(0x061A) volatile __PWM9DCLbits_t PWM9DCLbits;

#define _PWM9DCL_DC0            0x40
#define _PWM9DCL_PWM9DC0        0x40
#define _PWM9DCL_PWMPW0         0x40
#define _PWM9DCL_DC1            0x80
#define _PWM9DCL_PWM9DC1        0x80
#define _PWM9DCL_PWMPW1         0x80

//==============================================================================


//==============================================================================
//        PWM9DCH Bits

extern __at(0x061B) __sfr PWM9DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM9DC2            : 1;
    unsigned PWM9DC3            : 1;
    unsigned PWM9DC4            : 1;
    unsigned PWM9DC5            : 1;
    unsigned PWM9DC6            : 1;
    unsigned PWM9DC7            : 1;
    unsigned PWM9DC8            : 1;
    unsigned PWM9DC9            : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM9DCHbits_t;

extern __at(0x061B) volatile __PWM9DCHbits_t PWM9DCHbits;

#define _PWM9DCH_DC2            0x01
#define _PWM9DCH_PWM9DC2        0x01
#define _PWM9DCH_PWMPW2         0x01
#define _PWM9DCH_DC3            0x02
#define _PWM9DCH_PWM9DC3        0x02
#define _PWM9DCH_PWMPW3         0x02
#define _PWM9DCH_DC4            0x04
#define _PWM9DCH_PWM9DC4        0x04
#define _PWM9DCH_PWMPW4         0x04
#define _PWM9DCH_DC5            0x08
#define _PWM9DCH_PWM9DC5        0x08
#define _PWM9DCH_PWMPW5         0x08
#define _PWM9DCH_DC6            0x10
#define _PWM9DCH_PWM9DC6        0x10
#define _PWM9DCH_PWMPW6         0x10
#define _PWM9DCH_DC7            0x20
#define _PWM9DCH_PWM9DC7        0x20
#define _PWM9DCH_PWMPW7         0x20
#define _PWM9DCH_DC8            0x40
#define _PWM9DCH_PWM9DC8        0x40
#define _PWM9DCH_PWMPW8         0x40
#define _PWM9DCH_DC9            0x80
#define _PWM9DCH_PWM9DC9        0x80
#define _PWM9DCH_PWMPW9         0x80

//==============================================================================


//==============================================================================
//        PWM9CON Bits

extern __at(0x061C) __sfr PWM9CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM9POL            : 1;
    unsigned PWM9OUT            : 1;
    unsigned                    : 1;
    unsigned PWM9EN             : 1;
    };
  } __PWM9CONbits_t;

extern __at(0x061C) volatile __PWM9CONbits_t PWM9CONbits;

#define _PWM9CON_POL            0x10
#define _PWM9CON_PWM9POL        0x10
#define _PWM9CON_OUT            0x20
#define _PWM9CON_PWM9OUT        0x20
#define _PWM9CON_EN             0x80
#define _PWM9CON_PWM9EN         0x80

//==============================================================================


//==============================================================================
//        COG1PHR Bits

extern __at(0x068D) __sfr COG1PHR;

typedef union
  {
  struct
    {
    unsigned PHR0               : 1;
    unsigned PHR1               : 1;
    unsigned PHR2               : 1;
    unsigned PHR3               : 1;
    unsigned PHR4               : 1;
    unsigned PHR5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHR0             : 1;
    unsigned G1PHR1             : 1;
    unsigned G1PHR2             : 1;
    unsigned G1PHR3             : 1;
    unsigned G1PHR4             : 1;
    unsigned G1PHR5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned G1PHR              : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned PHR                : 6;
    unsigned                    : 2;
    };
  } __COG1PHRbits_t;

extern __at(0x068D) volatile __COG1PHRbits_t COG1PHRbits;

