OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1778.h
extern __at(0x090C) __sfr CM4CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C4SYNC             : 1;
    unsigned C4HYS              : 1;
    unsigned C4SP               : 1;
    unsigned C4ZLF              : 1;
    unsigned C4POL              : 1;
    unsigned                    : 1;
    unsigned C4OUT              : 1;
    unsigned C4ON               : 1;
    };
  } __CM4CON0bits_t;

extern __at(0x090C) volatile __CM4CON0bits_t CM4CON0bits;

#define _CM4CON0_SYNC           0x01
#define _CM4CON0_C4SYNC         0x01
#define _CM4CON0_HYS            0x02
#define _CM4CON0_C4HYS          0x02
#define _CM4CON0_Reserved       0x04
#define _CM4CON0_C4SP           0x04
#define _CM4CON0_ZLF            0x08
#define _CM4CON0_C4ZLF          0x08
#define _CM4CON0_POL            0x10
#define _CM4CON0_C4POL          0x10
#define _CM4CON0_OUT            0x40
#define _CM4CON0_C4OUT          0x40
#define _CM4CON0_ON             0x80
#define _CM4CON0_C4ON           0x80

//==============================================================================


//==============================================================================
//        CM4CON1 Bits

extern __at(0x090D) __sfr CM4CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4INTN             : 1;
    unsigned C4INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM4CON1bits_t;

extern __at(0x090D) volatile __CM4CON1bits_t CM4CON1bits;

#define _CM4CON1_INTN           0x01
#define _CM4CON1_C4INTN         0x01
#define _CM4CON1_INTP           0x02
#define _CM4CON1_C4INTP         0x02

//==============================================================================


//==============================================================================
//        CM4NSEL Bits

extern __at(0x090E) __sfr CM4NSEL;

typedef union
  {
  struct
    {
    unsigned C4NCH0             : 1;
    unsigned C4NCH1             : 1;
    unsigned C4NCH2             : 1;
    unsigned C4NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4NCH              : 4;
    unsigned                    : 4;
    };
  } __CM4NSELbits_t;

extern __at(0x090E) volatile __CM4NSELbits_t CM4NSELbits;

#define _C4NCH0                 0x01
#define _C4NCH1                 0x02
#define _C4NCH2                 0x04
#define _C4NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM4PSEL Bits

extern __at(0x090F) __sfr CM4PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C4PCH0             : 1;
    unsigned C4PCH1             : 1;
    unsigned C4PCH2             : 1;
    unsigned C4PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned C4PCH              : 4;
    unsigned                    : 4;
    };
  } __CM4PSELbits_t;

extern __at(0x090F) volatile __CM4PSELbits_t CM4PSELbits;

#define _CM4PSEL_PCH0           0x01
#define _CM4PSEL_C4PCH0         0x01
#define _CM4PSEL_PCH1           0x02
#define _CM4PSEL_C4PCH1         0x02
#define _CM4PSEL_PCH2           0x04
#define _CM4PSEL_C4PCH2         0x04
#define _CM4PSEL_PCH3           0x08
#define _CM4PSEL_C4PCH3         0x08

//==============================================================================


//==============================================================================
//        CM5CON0 Bits

extern __at(0x0910) __sfr CM5CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C5SYNC             : 1;
    unsigned C5HYS              : 1;
    unsigned C5SP               : 1;
    unsigned C5ZLF              : 1;
    unsigned C5POL              : 1;
    unsigned                    : 1;
    unsigned C5OUT              : 1;
    unsigned C5ON               : 1;
    };
  } __CM5CON0bits_t;

extern __at(0x0910) volatile __CM5CON0bits_t CM5CON0bits;

#define _CM5CON0_SYNC           0x01
#define _CM5CON0_C5SYNC         0x01
#define _CM5CON0_HYS            0x02
#define _CM5CON0_C5HYS          0x02
#define _CM5CON0_Reserved       0x04
#define _CM5CON0_C5SP           0x04
#define _CM5CON0_ZLF            0x08
#define _CM5CON0_C5ZLF          0x08
#define _CM5CON0_POL            0x10
#define _CM5CON0_C5POL          0x10
#define _CM5CON0_OUT            0x40
#define _CM5CON0_C5OUT          0x40
#define _CM5CON0_ON             0x80
#define _CM5CON0_C5ON           0x80

//==============================================================================


//==============================================================================
//        CM5CON1 Bits

extern __at(0x0911) __sfr CM5CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C5INTN             : 1;
    unsigned C5INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM5CON1bits_t;

extern __at(0x0911) volatile __CM5CON1bits_t CM5CON1bits;

#define _CM5CON1_INTN           0x01
#define _CM5CON1_C5INTN         0x01
#define _CM5CON1_INTP           0x02
#define _CM5CON1_C5INTP         0x02

//==============================================================================


//==============================================================================
//        CM5NSEL Bits

extern __at(0x0912) __sfr CM5NSEL;

typedef union
  {
  struct
    {
    unsigned C5NCH0             : 1;
    unsigned C5NCH1             : 1;
    unsigned C5NCH2             : 1;
    unsigned C5NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C5NCH              : 4;
    unsigned                    : 4;
    };
  } __CM5NSELbits_t;

extern __at(0x0912) volatile __CM5NSELbits_t CM5NSELbits;

#define _C5NCH0                 0x01
#define _C5NCH1                 0x02
#define _C5NCH2                 0x04
#define _C5NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM5PSEL Bits

extern __at(0x0913) __sfr CM5PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C5PCH0             : 1;
    unsigned C5PCH1             : 1;
    unsigned C5PCH2             : 1;
    unsigned C5PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C5PCH              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };
  } __CM5PSELbits_t;

extern __at(0x0913) volatile __CM5PSELbits_t CM5PSELbits;

#define _CM5PSEL_PCH0           0x01
#define _CM5PSEL_C5PCH0         0x01
#define _CM5PSEL_PCH1           0x02
#define _CM5PSEL_C5PCH1         0x02
#define _CM5PSEL_PCH2           0x04
#define _CM5PSEL_C5PCH2         0x04
#define _CM5PSEL_PCH3           0x08
#define _CM5PSEL_C5PCH3         0x08

//==============================================================================


//==============================================================================
//        CM6CON0 Bits

extern __at(0x0914) __sfr CM6CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C6SYNC             : 1;
    unsigned C6HYS              : 1;
    unsigned C6SP               : 1;
    unsigned C6ZLF              : 1;
    unsigned C6POL              : 1;
    unsigned                    : 1;
    unsigned C6OUT              : 1;
    unsigned C6ON               : 1;
    };
  } __CM6CON0bits_t;

extern __at(0x0914) volatile __CM6CON0bits_t CM6CON0bits;

#define _CM6CON0_SYNC           0x01
#define _CM6CON0_C6SYNC         0x01
#define _CM6CON0_HYS            0x02
#define _CM6CON0_C6HYS          0x02
#define _CM6CON0_Reserved       0x04
#define _CM6CON0_C6SP           0x04
#define _CM6CON0_ZLF            0x08
#define _CM6CON0_C6ZLF          0x08
#define _CM6CON0_POL            0x10
#define _CM6CON0_C6POL          0x10
#define _CM6CON0_OUT            0x40
#define _CM6CON0_C6OUT          0x40
#define _CM6CON0_ON             0x80
#define _CM6CON0_C6ON           0x80

//==============================================================================


//==============================================================================
//        CM6CON1 Bits

